Public Attributes | List of all members
API_Sector Struct Reference
Element Manager API
Describes the geometry of a 2D line. More...
#include <APIdefs_Base.h>
 Public Attributes
API_Coord  | c1
Start point.
API_Coord  | c2
End point.
Detailed Description
Describes the geometry of a 2D line.
Member Data Documentation
◆ c1
 API_Sector::c1
Start point.
◆ c2
 API_Sector::c2
End point.